#ifndef DEBUG_FONT_H

/********************************************************************************
 * 内容  : フォント初期化
 * 引数  : なし
 * 戻り値: なし
 ***************************************/
void DebugFontInit( void );

/********************************************************************************
 * 内容  : フォント選択
 * 引数  : HWND hwnd
 * 戻り値: BOOL (TRUE:OKが押された、FALSE:キャンセルされた)
 ***************************************/
BOOL DebugFontChooseFont( HWND hwnd );

/********************************************************************************
 * 内容  : 論理フォント取得
 * 引数  : なし
 * 戻り値: LOGFONT *
 ***************************************/
LOGFONT *DebugFontGetLogFont( void );

#define DEBUG_FONT_H
#endif /* DEBUG_FONT_H */
