#ifndef DEBUGWND_MENU_H

/********************************************************************************
 * 内容  : メニューの生成
 * 引数  : なし
 * 戻り値: HMENU
 ***************************************/
HMENU DebugMenuCreate( void );

/********************************************************************************
 * 内容  : アクセラレータの生成
 * 引数  : なし
 * 戻り値: HACCEL
 ***************************************/
HACCEL DebugAccelCreate( void );

/********************************************************************************
 * 内容  : 指定の項目がチェックされているか問い合わせ
 * 引数  : UINT itemID
 * 戻り値: BOOL
 ***************************************/
BOOL DebugMenuInqItemChecked( UINT itemID );

/********************************************************************************
 * 内容  : 指定の項目のチェックを付ける
 * 引数  : UINT itemID
 * 戻り値: なし
 ***************************************/
void DebugMenuCheckItem( UINT itemID );

/********************************************************************************
 * 内容  : 指定の項目のチェックを外す
 * 引数  : UINT itemID
 * 戻り値: なし
 ***************************************/
void DebugMenuUnCheckItem( UINT itemID );

/********************************************************************************
 * 内容  : 指定の項目を有効にする
 * 引数  : UINT itemID
 * 戻り値: なし
 ***************************************/
void DebugMenuEnableItem( UINT itemID );

/********************************************************************************
 * 内容  : 指定の項目を無効にする
 * 引数  : UINT itemID
 * 戻り値: なし
 ***************************************/
void DebugMenuUnEnableItem( UINT itemID );

#define DEBUGWND_MENU_H
#endif /* DEBUGWND_MENU_H */
